transonic-dlrbuffet/setups.orig/common/0.orig/back/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


#include        "include/freestreamConditions"



dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform $Tinlet;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    row_1_PER1
    {
        type            cyclic;
    }
    row_1_PER2
    {
        type            cyclic;

    }
    Blade
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
